<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;
use phpDocumentor\Reflection\Types\Null_;

class City extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        DB::table('cities')->insert([
            [
                'id' => 1,
                'city_id' => Null,
                'name' => 'نابلس',
                'created_at' => '2021-03-12 22:00:42.000000',
                'updated_at' => '2021-03-12 22:00:42.000000'
            ],
            [
                'id' => 2,
                'city_id' => Null,
                'name' => 'قلقيلية',
                'created_at' => '2021-03-12 22:00:42.000000',
                'updated_at' => '2021-03-12 22:00:42.000000'
            ],
            [
                'id' => 3,
                'city_id' => Null,
                'name' => 'جنين',
                'created_at' => '2021-03-12 22:00:42.000000',
                'updated_at' => '2021-03-12 22:00:42.000000'
            ],
            [
                'id' => 4,
                'city_id' => Null,
                'name' => 'سلفيت',
                'created_at' => '2021-03-12 22:00:42.000000',
                'updated_at' => '2021-03-12 22:00:42.000000'
            ],
            [
                'id' => 5,
                'city_id' => Null,
                'name' => 'رام الله',
                'created_at' => '2021-03-12 22:00:42.000000',
                'updated_at' => '2021-03-12 22:00:42.000000'
            ],  [
                'id' => 6,
                'city_id' => Null,
                'name' => 'اريحا',
                'created_at' => '2021-03-12 22:00:42.000000',
                'updated_at' => '2021-03-12 22:00:42.000000'
            ],
            [
                'id' => 7,
                'city_id' => Null,
                'name' => 'طولكرم',
                'created_at' => '2021-03-12 22:00:42.000000',
                'updated_at' => '2021-03-12 22:00:42.000000'
            ],
            [
                'id' => 25,
                'city_id' => 1,
                'name' => 'بيت فوريك',
                'created_at' => '2021-03-12 22:00:42.000000',
                'updated_at' => '2021-03-12 22:00:42.000000'
            ],
            [
                'id' => 26,
                'city_id' => 1,
                'name' => 'بيتا',
                'created_at' => '2021-03-12 22:00:42.000000',
                'updated_at' => '2021-03-12 22:00:42.000000'
            ],
            [
                'id' => 27,
                'city_id' => 1,
                'name' => 'عقربة',
                'created_at' => '2021-03-12 22:00:42.000000',
                'updated_at' => '2021-03-12 22:00:42.000000'
            ],
            [
                'id' => 28,
                'city_id' => 1,
                'name' => 'عصيرة الشمالية',
                'created_at' => '2021-03-12 22:00:42.000000',
                'updated_at' => '2021-03-12 22:00:42.000000'
            ],
            [
                'id' => 29,
                'city_id' => 1,
                'name' => 'قبلان',
                'created_at' => '2021-03-12 22:00:42.000000',
                'updated_at' => '2021-03-12 22:00:42.000000'
            ],
            [
                'id' => 30,
                'city_id' => 1,
                'name' => 'مادما',
                'created_at' => '2021-03-12 22:00:42.000000',
                'updated_at' => '2021-03-12 22:00:42.000000'
            ],
            [
                'id' => 31,
                'city_id' => 1,
                'name' => 'بيت دجن',
                'created_at' => '2021-03-12 22:00:42.000000',
                'updated_at' => '2021-03-12 22:00:42.000000'
            ],
            [
                'id' => 32,
                'city_id' => 1,
                'name' => 'بيت امرين',
                'created_at' => '2021-03-12 22:00:42.000000',
                'updated_at' => '2021-03-12 22:00:42.000000'
            ],
            [
                'id' => 33,
                'city_id' => 1,
                'name' => 'دوما',
                'created_at' => '2021-03-12 22:00:42.000000',
                'updated_at' => '2021-03-12 22:00:42.000000'
            ],
            [
                'id' => 34,
                'city_id' => 1,
                'name' => 'دير الحطب',
                'created_at' => '2021-03-12 22:00:42.000000',
                'updated_at' => '2021-03-12 22:00:42.000000'
            ],
            [
                'id' => 35,
                'city_id' => 1,
                'name' => 'العقربانية',
                'created_at' => '2021-03-12 22:00:42.000000',
                'updated_at' => '2021-03-12 22:00:42.000000'
            ],
            [
                'id' => 36,
                'city_id' => 1,
                'name' => 'مجدل بني فاضل',
                'created_at' => '2021-03-12 22:00:42.000000',
                'updated_at' => '2021-03-12 22:00:42.000000'
            ],
            [
                'id' => 37,
                'city_id' => 1,
                'name' => 'تلفيت',
                'created_at' => '2021-03-12 22:00:42.000000',
                'updated_at' => '2021-03-12 22:00:42.000000'
            ],
            [
                'id' => 38,
                'city_id' => 1,
                'name' => 'قريوت',
                'created_at' => '2021-03-12 22:00:42.000000',
                'updated_at' => '2021-03-12 22:00:42.000000'
            ],
            [
                'id' => 39,
                'city_id' => 1,
                'name' => 'جالود',
                'created_at' => '2021-03-12 22:00:42.000000',
                'updated_at' => '2021-03-12 22:00:42.000000'
            ],
            [
                'id' => 40,
                'city_id' => 1,
                'name' => 'قصرى',
                'created_at' => '2021-03-12 22:00:42.000000',
                'updated_at' => '2021-03-12 22:00:42.000000'
            ],
            [
                'id' => 41,
                'city_id' => 1,
                'name' => 'جوريش',
                'created_at' => '2021-03-12 22:00:42.000000',
                'updated_at' => '2021-03-12 22:00:42.000000'
            ],
            [
                'id' => 42,
                'city_id' => 1,
                'name' => 'يتما',
                'created_at' => '2021-03-12 22:00:42.000000',
                'updated_at' => '2021-03-12 22:00:42.000000'
            ],
            [
                'id' => 43,
                'city_id' => 1,
                'name' => 'سالم',
                'created_at' => '2021-03-12 22:00:42.000000',
                'updated_at' => '2021-03-12 22:00:42.000000'
            ],
            [
                'id' => 44,
                'city_id' => 1,
                'name' => 'عزموط',
                'created_at' => '2021-03-12 22:00:42.000000',
                'updated_at' => '2021-03-12 22:00:42.000000'
            ],
            [
                'id' => 45,
                'city_id' => 1,
                'name' => 'بورين',
                'created_at' => '2021-03-12 22:00:42.000000',
                'updated_at' => '2021-03-12 22:00:42.000000'
            ],
            [
                'id' => 46,
                'city_id' => 1,
                'name' => 'عراق بورين',
                'created_at' => '2021-03-12 22:00:42.000000',
                'updated_at' => '2021-03-12 22:00:42.000000'
            ],
            [
                'id' => 47,
                'city_id' => 1,
                'name' => 'جماعين',
                'created_at' => '2021-03-12 22:00:42.000000',
                'updated_at' => '2021-03-12 22:00:42.000000'
            ],
            [
                'id' => 48,
                'city_id' => 1,
                'name' => 'حواره',
                'created_at' => '2021-03-12 22:00:42.000000',
                'updated_at' => '2021-03-12 22:00:42.000000'
            ],
            [
                'id' => 49,
                'city_id' => 1,
                'name' => 'سبسطية',
                'created_at' => '2021-03-12 22:00:42.000000',
                'updated_at' => '2021-03-12 22:00:42.000000'
            ],
            [
                'id' => 50,
                'city_id' => 1,
                'name' => 'اجنسيا',
                'created_at' => '2021-03-12 22:00:42.000000',
                'updated_at' => '2021-03-12 22:00:42.000000'
            ],
            [
                'id' => 51,
                'city_id' => 1,
                'name' => 'اودلا',
                'created_at' => '2021-03-12 22:00:42.000000',
                'updated_at' => '2021-03-12 22:00:42.000000'
            ],
            [
                'id' => 52,
                'city_id' => 1,
                'name' => 'اوصرين',
                'created_at' => '2021-03-12 22:00:42.000000',
                'updated_at' => '2021-03-12 22:00:42.000000'
            ],
            [
                'id' => 53,
                'city_id' => 1,
                'name' => 'برقة',
                'created_at' => '2021-03-12 22:00:42.000000',
                'updated_at' => '2021-03-12 22:00:42.000000'
            ],
            [
                'id' => 54,
                'city_id' => 1,
                'name' => 'بيت ايبا',
                'created_at' => '2021-03-12 22:00:42.000000',
                'updated_at' => '2021-03-12 22:00:42.000000'
            ],
            [
                'id' => 55,
                'city_id' => 1,
                'name' => 'بيت وزن',
                'created_at' => '2021-03-12 22:00:42.000000',
                'updated_at' => '2021-03-12 22:00:42.000000'
            ],
            [
                'id' => 56,
                'city_id' => 1,
                'name' => 'بزاريا',
                'created_at' => '2021-03-12 22:00:42.000000',
                'updated_at' => '2021-03-12 22:00:42.000000'
            ],
            [
                'id' => 57,
                'city_id' => 1,
                'name' => 'تل',
                'created_at' => '2021-03-12 22:00:42.000000',
                'updated_at' => '2021-03-12 22:00:42.000000'
            ],
            [
                'id' => 95,
                'city_id' => 4,
                'name' => 'حارس',
                'created_at' => '2021-03-12 22:00:42.000000',
                'updated_at' => '2021-03-12 22:00:42.000000'
            ],
            [
                'id' => 150,
                'city_id' => 4,
                'name' => 'بروقين',
                'created_at' => '2021-03-12 22:00:42.000000',
                'updated_at' => '2021-03-12 22:00:42.000000'
            ],
            [
                'id' => 149,
                'city_id' => 4,
                'name' => 'بديا',
                'created_at' => '2021-03-12 22:00:42.000000',
                'updated_at' => '2021-03-12 22:00:42.000000'
            ],
            [
                'id' => 148,
                'city_id' => 4,
                'name' => 'دير استيا',
                'created_at' => '2021-03-12 22:00:42.000000',
                'updated_at' => '2021-03-12 22:00:42.000000'
            ],
            [
                'id' => 147,
                'city_id' => 4,
                'name' => 'الزاوية',
                'created_at' => '2021-03-12 22:00:42.000000',
                'updated_at' => '2021-03-12 22:00:42.000000'
            ],
            [
                'id' => 146,
                'city_id' => 2,
                'name' => 'حبلة',
                'created_at' => '2021-03-12 22:00:42.000000',
                'updated_at' => '2021-03-12 22:00:42.000000'
            ],
            [
                'id' => 145,
                'city_id' => 2,
                'name' => 'اماتين',
                'created_at' => '2021-03-12 22:00:42.000000',
                'updated_at' => '2021-03-12 22:00:42.000000'
            ],
            [
                'id' => 144,
                'city_id' => 2,
                'name' => 'جيت',
                'created_at' => '2021-03-12 22:00:42.000000',
                'updated_at' => '2021-03-12 22:00:42.000000'
            ],
            [
                'id' => 143,
                'city_id' => 2,
                'name' => 'كفر قدوم',
                'created_at' => '2021-03-12 22:00:42.000000',
                'updated_at' => '2021-03-12 22:00:42.000000'
            ],
            [
                'id' => 142,
                'city_id' => 2,
                'name' => 'كفر لاقف',
                'created_at' => '2021-03-12 22:00:42.000000',
                'updated_at' => '2021-03-12 22:00:42.000000'
            ],
            [
                'id' => 141,
                'city_id' => 3,
                'name' => 'سيلة الحارثية',
                'created_at' => '2021-03-12 22:00:42.000000',
                'updated_at' => '2021-03-12 22:00:42.000000'
            ],
            [
                'id' => 140,
                'city_id' => 3,
                'name' => 'سيلة الظهر',
                'created_at' => '2021-03-12 22:00:42.000000',
                'updated_at' => '2021-03-12 22:00:42.000000'
            ],
            [
                'id' => 139,
                'city_id' => 3,
                'name' => 'بزاريا',
                'created_at' => '2021-03-12 22:00:42.000000',
                'updated_at' => '2021-03-12 22:00:42.000000'
            ],
            [
                'id' => 138,
                'city_id' => 3,
                'name' => 'الجلمة',
                'created_at' => '2021-03-12 22:00:42.000000',
                'updated_at' => '2021-03-12 22:00:42.000000'
            ],
            [
                'id' => 137,
                'city_id' => 3,
                'name' => 'اليامون',
                'created_at' => '2021-03-12 22:00:42.000000',
                'updated_at' => '2021-03-12 22:00:42.000000'
            ],
            [
                'id' => 136,
                'city_id' => 3,
                'name' => 'كفر راعي',
                'created_at' => '2021-03-12 22:00:42.000000',
                'updated_at' => '2021-03-12 22:00:42.000000'
            ],
            [
                'id' => 135,
                'city_id' => 7,
                'name' => 'صيدا',
                'created_at' => '2021-03-12 22:00:42.000000',
                'updated_at' => '2021-03-12 22:00:42.000000'
            ],
            [
                'id' => 134,
                'city_id' => 7,
                'name' => 'عتيل',
                'created_at' => '2021-03-12 22:00:42.000000',
                'updated_at' => '2021-03-12 22:00:42.000000'
            ],
            [
                'id' => 133,
                'city_id' => 7,
                'name' => 'علار',
                'created_at' => '2021-03-12 22:00:42.000000',
                'updated_at' => '2021-03-12 22:00:42.000000'
            ],
            [
                'id' => 132,
                'city_id' => 7,
                'name' => 'ارتاح',
                'created_at' => '2021-03-12 22:00:42.000000',
                'updated_at' => '2021-03-12 22:00:42.000000'
            ],
            [
                'id' => 131,
                'city_id' => 7,
                'name' => 'اكتابا',
                'created_at' => '2021-03-12 22:00:42.000000',
                'updated_at' => '2021-03-12 22:00:42.000000'
            ],
            [
                'id' => 130,
                'city_id' => 7,
                'name' => 'عنبتا',
                'created_at' => '2021-03-12 22:00:42.000000',
                'updated_at' => '2021-03-12 22:00:42.000000'
            ],
            [
                'id' => 129,
                'city_id' => 7,
                'name' => 'كفر اللبد',
                'created_at' => '2021-03-12 22:00:42.000000',
                'updated_at' => '2021-03-12 22:00:42.000000'
            ],
            [
                'id' => 128,
                'city_id' => 7,
                'name' => 'بيت ليد',
                'created_at' => '2021-03-12 22:00:42.000000',
                'updated_at' => '2021-03-12 22:00:42.000000'
            ],
            [
                'id' => 127,
                'city_id' => 5,
                'name' => 'الساوية',
                'created_at' => '2021-03-12 22:00:42.000000',
                'updated_at' => '2021-03-12 22:00:42.000000'
            ],
            [
                'id' => 126,
                'city_id' => 5,
                'name' => 'النبي صالح',
                'created_at' => '2021-03-12 22:00:42.000000',
                'updated_at' => '2021-03-12 22:00:42.000000'
            ],
            [
                'id' => 124,
                'city_id' => 5,
                'name' => 'سلواد',
                'created_at' => '2021-03-12 22:00:42.000000',
                'updated_at' => '2021-03-12 22:00:42.000000'
            ],
            [
                'id' => 123,
                'city_id' => 5,
                'name' => 'كفر عقب',
                'created_at' => '2021-03-12 22:00:42.000000',
                'updated_at' => '2021-03-12 22:00:42.000000'
            ],  [
                'id' => 122,
                'city_id' => 5,
                'name' => 'بيتونيا',
                'created_at' => '2021-03-12 22:00:42.000000',
                'updated_at' => '2021-03-12 22:00:42.000000'
            ],
            [
                'id' => 120,
                'city_id' => 5,
                'name' => 'ترمسعيا',
                'created_at' => '2021-03-12 22:00:42.000000',
                'updated_at' => '2021-03-12 22:00:42.000000'
            ],
            [
                'id' => 160,
                'city_id' => 6,
                'name' => 'الجفتلك',
                'created_at' => '2021-03-12 22:00:42.000000',
                'updated_at' => '2021-03-12 22:00:42.000000'
            ],
            [
                'id' => 162,
                'city_id' => 6,
                'name' => 'الاغوار',
                'created_at' => '2021-03-12 22:00:42.000000',
                'updated_at' => '2021-03-12 22:00:42.000000'
            ],
            [
                'id' => 166,
                'city_id' => 6,
                'name' => 'النبي موسى',
                'created_at' => '2021-03-12 22:00:42.000000',
                'updated_at' => '2021-03-12 22:00:42.000000'
            ],

            [
                'id' => 200,
                'city_id' => 10,
                'name' => 'الاردن',
                'created_at' => '2021-03-12 22:00:42.000000',
                'updated_at' => '2021-03-12 22:00:42.000000'
            ],

            [
                'id' => 300,
                'city_id' => 10,
                'name' => 'تركيا',
                'created_at' => '2021-03-12 22:00:42.000000',
                'updated_at' => '2021-03-12 22:00:42.000000'
            ],

            [
                'id' => 400,
                'city_id' => 10,
                'name' => 'الصين',
                'created_at' => '2021-03-12 22:00:42.000000',
                'updated_at' => '2021-03-12 22:00:42.000000'
            ],
            [
                'id' => 500,
                'city_id' => 10,
                'name' => 'فلسطين',
                'created_at' => '2021-03-12 22:00:42.000000',
                'updated_at' => '2021-03-12 22:00:42.000000'
            ],
        ]);
    }
}
